app/controllers/api/players_controller.rb

        def get_suggestions
            suggestions = Player.where("name ~* ?", "^#{params[:name]}").pluck(:name, :position, :team)
---
SELECT "players"."name", "players"."position", "players"."team" FROM "players" WHERE (name ~* '^A')