app/controllers/api/posts_controller.rb

        def index
            players = Player.pluck(:name).uniq
---
SELECT "players"."name" FROM "players"